{
  "很遗憾您这没有能用的显卡来支持您训练": "Infelizmente, você não tem uma placa gráfica adequada para apoiar seu treinamento",
  "是": "Sí",
  "step1:正在处理数据": "Passo 1: Procesando dados",
  "step2a:无需提取音高": "Passo 2a: Não há necessidade de extrair tom",
  "step2b:正在提取特征": "Passo 2b: Extraindo características",
  "step3a:正在训练模型": "Passo 3a: Treinando o modelo",
  "训练结束, 您可查看控制台训练日志或实验文件夹下的train.log": "Treinamento concluído, você pode visualizar o log de treinamento no console ou no arquivo train.log na pasta do experimento",
  "全流程结束！": "Todo o processo acabou!",
  "本软件以MIT协议开源, 作者不对软件具备任何控制力, 使用软件者、传播软件导出的声音者自负全责. <br>如不认可该条款, 则不能使用或引用软件包内任何代码和文件. 详见根目录<b>LICENSE</b>.": "<b>Saiyd ❤️</b>",
  "模型推理": "inferência de modelo",
  "推理音色": "inferência de voz",
  "刷新音色列表和索引路径": "Atualize a lista de vozes e índice de rotas",
  "卸载音色省显存": "Descarregar voz para economizar memória GPU",
  "请选择说话人id": "selecione um ID de alto-falante",
  "男转女推荐+12key, 女转男推荐-12key, 如果音域爆炸导致音色失真也可以自己调整到合适音域. ": "Valor +12 recomendada para conversão de voz masculina para feminina, valor -12 para conversão de voz feminina para masculina. Se a faixa de tom for muito ampla e causar distorção, ajuste você mesmo para uma faixa adequada.",
  "变调(整数, 半音数量, 升八度12降八度-12)": "Mudança de tom (inteiro, número de semitons, subir uma oitava +12 ou descer uma oitava -12)",
  "输入待处理音频文件路径(默认是正确格式示例)": "Digite o caminho do arquivo de áudio a ser processado (o formato padrão é o exemplo correto)",
  "选择音高提取算法,输入歌声可用pm提速,harvest低音好但巨慢无比,crepe效果好但吃GPU,rmvpe效果最好且微吃GPU": "Escolha o algoritmo de extração de tom, use 'pm' para acelerar a entrada do canto, 'harvest' é bom para graves, mas extremamente lento, 'crepe' tem bons resultados, mas consome GPU",
  ">=3则使用对harvest音高识别的结果使用中值滤波，数值为滤波半径，使用可以削弱哑音": "Se >=3, então use o resultado do reconhecimento de afinação de 'havest' com filtro mediano, o valor é o raio do filtro, usá-lo pode enfraquecer o som abafado",
  "特征检索库文件路径,为空则使用下拉的选择结果": "Caminho do arquivo da biblioteca de características, se estiver vazio, o resultado da seleção suspensa será usado",
  "自动检测index路径,下拉式选择(dropdown)": "Detecção automática de caminho de índice, seleção suspensa",
  "特征文件路径": "Caminho do arquivo de características",
  "检索特征占比": "Proporção da função de pesquisa",
  "后处理重采样至最终采样率，0为不进行重采样": "Reamostragem pós-processo para a taxa de amostragem final, 0 significa sem reamostragem",
  "输入源音量包络替换输出音量包络融合比例，越靠近1越使用输出包络": "Taxa de fusão para substituir o envelope do volume de entrada pelo envelope do volume de saída, quanto mais próximo de 1, mais o envelope de saída é usado",
  "保护清辅音和呼吸声，防止电音撕裂等artifact，拉满0.5不开启，调低加大保护力度但可能降低索引效果": "Proteja consoantes claras e respiração, evite artefatos como distorção de som eletrônico, 0,5 não está ativado, reduzir aumentará a proteção, mas pode reduzir o efeito do índice",
  "F0曲线文件, 可选, 一行一个音高, 代替默认F0及升降调": "Arquivo de curva F0, opcional, um tom por linha, em vez do F0 padrão e mudança de tom",
  "转换": "Conversão",
  "输出信息": "Informações de saída",
  "输出音频(右下角三个点,点了可以下载)": "Saída de áudio (clique nos três pontos no canto inferior direito para fazer o download)",
  "批量转换, 输入待转换音频文件夹, 或上传多个音频文件, 在指定文件夹(默认opt)下输出转换的音频. ": "Conversão em lote, insira a pasta que contém os arquivos de áudio para converter ou fazer upload de vários arquivos de áudio. O áudio convertido será enviado para a pasta especificada (padrão).",
  "指定输出文件夹": "Especifique a pasta de saída",
  "输入待处理音频文件夹路径(去文件管理器地址栏拷就行了)": "Digite o caminho para a pasta de áudio a ser processada (basta copiá-lo da barra de endereço do gerenciador de arquivos)",
  "也可批量输入音频文件, 二选一, 优先读文件夹": "Vários arquivos de áudio também podem ser inseridos, em qualquer opção, com prioridade dada à pasta",
  "导出文件格式": "Exportar formato de arquivo",
  "伴奏人声分离&去混响&去回声": "Separación de voz acompañante & eliminación de reverberación & eco",
  "人声伴奏分离批量处理， 使用UVR5模型。 <br>合格的文件夹路径格式举例： E:\\codes\\py39\\vits_vc_gpu\\白鹭霜华测试样例(去文件管理器地址栏拷就行了)。 <br>模型分为三类： <br>1、保留人声：不带和声的音频选这个，对主人声保留比HP5更好。内置HP2和HP3两个模型，HP3可能轻微漏伴奏但对主人声保留比HP2稍微好一丁点； <br>2、仅保留主人声：带和声的音频选这个，对主人声可能有削弱。内置HP5一个模型； <br> 3、去混响、去延迟模型（by FoxJoy）：<br>  (1)MDX-Net(onnx_dereverb):对于双通道混响是最好的选择，不能去除单通道混响；<br>&emsp;(234)DeEcho:去除延迟效果。Aggressive比Normal去除得更彻底，DeReverb额外去除混响，可去除单声道混响，但是对高频重的板式混响去不干净。<br>去混响/去延迟，附：<br>1、DeEcho-DeReverb模型的耗时是另外2个DeEcho模型的接近2倍；<br>2、MDX-Net-Dereverb模型挺慢的；<br>3、个人推荐的最干净的配置是先MDX-Net再DeEcho-Aggressive。": "Processamento em lote para separação de acompanhamento vocal usando o modelo UVR5.<br>Exemplo de formato de caminho de pasta válido: D:\\path\\to\\the\\input\\folder\\(copiar da barra de endereço do gerenciador de arquivos).< br>O modelo está dividido em três categorias:<br>1. Preservar vocais: Escolha esta opção para áudio sem harmonias. Preserva os vocais melhor que o HP5. Inclui dois modelos integrados: HP2 e HP3. O HP3 pode filtrar um pouco o acompanhamento, mas preserva os vocais um pouco melhor que o HP2.<br>2. Preservar apenas os vocais principais: Escolha esta opção para áudio com harmonias. Isso pode enfraquecer os vocais principais. Inclui um modelo integrado: HP5.<br>3. Modelos de de-reverb e de-delay (da FoxJoy):<br>  (1) MDX-Net: Melhor escolha para remoção de reverb estéreo, mas não pode remover reverb mono;<br>&emsp;(234) DeEcho : Remove efeitos de delay. O modo Agressivo remove mais completamente do que o modo Normal. O DeReverb também remove a reverberação e pode remover a reverberação mono, mas não de forma muito eficaz para conteúdo de alta frequência com muita reverberação.<br>Notas de de-reverb/de-delay:<br>1. O tempo de processamento do modelo DeEcho-DeReverb é aproximadamente o dobro dos outros dois modelos DeEcho.<br>2. O modelo MDX-Net-Dereverb é bastante lento.<br>3. A configuração mais limpa recomendada é aplicar primeiro o MDX-Net e depois o DeEcho-Aggressive.",
  "输入待处理音频文件夹路径": "Digite o caminho para a pasta de áudio a ser processada",
  "模型": "Modelo",
  "指定输出主人声文件夹": "Especifique a pasta de saída para a voz principal",
  "指定输出非主人声文件夹": "Especifique a pasta de saída para vozes não principais",
  "训练": "Treinamento",
  "step1: 填写实验配置. 实验数据放在logs下, 每个实验一个文件夹, 需手工输入实验名路径, 内含实验配置, 日志, 训练得到的模型文件. ": "Etapa 1: conclua a configuração do treinamento. Os dados do treinamento são armazenados no diretório 'logs', com cada treinamento em uma pasta separada. O caminho do nome do treinamento deve ser inserido manualmente e deve conter a configuração do treinamento, os logs e os arquivos do modelo treinado.",
  "输入实验名": "Digite o nome do modelo",
  "目标采样率": "Taxa de amostragem alvo",
  "模型是否带音高指导(唱歌一定要, 语音可以不要)": "Se o modelo tiver um guia de pitch (necessário para cantar, mas não para falar)",
  "版本": "Versão",
  "提取音高和处理数据使用的CPU进程数": "Número de processos de CPU usados ​​para extrair o tom e processar os dados",
  "step2a: 自动遍历训练文件夹下所有可解码成音频的文件并进行切片归一化, 在实验目录下生成2个wav文件夹; 暂时只支持单人训练. ": "Etapa 2a: Percorra automaticamente a pasta de treinamento e corte e normalize todos os arquivos de áudio que podem ser decodificados em áudio. Duas pastas 'wav' serão geradas no diretório do experimento. Atualmente, apenas uma pessoa é apoiada para treinamento.",
  "输入训练文件夹路径": "Insira o caminho da pasta de treinamento",
  "请指定说话人id": "Especifique o ID do cantor",
  "处理数据": "Para processar dados",
  "step2b: 使用CPU提取音高(如果模型带音高), 使用GPU提取特征(选择卡号)": "Etapa 2b: Use CPU para extrair pitch (se o modelo tiver guia de pitch) e GPU para extrair características (selecione o número da GPU).",
  "以-分隔输入使用的卡号, 例如   0-1-2   使用卡0和卡1和卡2": "Separe os números de ID da GPU com '-' ao inseri-los. Por exemplo, '0-1-2' significa usar GPU 0, GPU 1 e GPU 2.",
  "显卡信息": "Informações da GPU",
  "选择音高提取算法:输入歌声可用pm提速,高质量语音但CPU差可用dio提速,harvest质量更好但慢": "Selecione o algoritmo de extração de tom: use 'pm' para processamento mais rápido da voz cantada, 'dio' para fala de alta qualidade, mas processamento mais lento, e 'crepe' para melhor qualidade, mas processamento mais lento.",
  "rmvpe卡号配置：以-分隔输入使用的不同进程卡号,例如0-0-1使用在卡0上跑2个进程并在卡1上跑1个进程": "Configuração do número do GPU rmvpe: Use - para separar os diferentes números de GPU de processo usados. Por exemplo, 0-0-1 é usado para executar 2 processos no GPU 0 e 1 processo no GPU 1.",
  "特征提取": "Extração de recursos",
  "step3: 填写训练设置, 开始训练模型和索引": "Etapa 3: conclua a configuração do treinamento e comece a treinar o modelo e o índice.",
  "保存频率save_every_epoch": "requência de salvamento (save_every_epoch)",
  "总训练轮数total_epoch": "Total de épocas de treinamento (total_epoch)",
  "每张显卡的batch_size": "Tamanho do lote (batch_size) por placa gráfica",
  "是否仅保存最新的ckpt文件以节省硬盘空间": "Se deseja salvar apenas o arquivo ckpt mais recente para economizar espaço em disco",
  "否": "NÃO",
  "是否缓存所有训练集至显存. 10min以下小数据可缓存以加速训练, 大数据缓存会炸显存也加不了多少速": "Se todos os conjuntos de treinamento devem ser armazenados em cache na memória da GPU. Pequenos conjuntos de dados (menos de 10 minutos) podem ser armazenados em cache para acelerar o treinamento, mas armazenar grandes conjuntos de dados em cache pode causar erros de memória na GPU e não aumentar significativamente a velocidade.",
  "是否在每次保存时间点将最终小模型保存至weights文件夹": "Salvar o pequeno modelo final na pasta 'weights' em cada ponto de salvamento?",
  "加载预训练底模G路径": "Carregue o caminho G do modelo base pré-treinado.",
  "加载预训练底模D路径": "Carregue o caminho D do modelo base pré-treinado.",
  "训练模型": "Treinar Modelo",
  "训练特征索引": "Índice de características de treinamento",
  "一键训练": "Treinamento com um clique.",
  "ckpt处理": "Processamento de recebimento",
  "模型融合, 可用于测试音色融合": "Fusão de modelos, pode ser usada para mesclar diferentes vozes",
  "A模型路径": "Rota modelo A.",
  "B模型路径": "Rota modelo B",
  "A模型权重": "Um weights de modelo para o modelo A.",
  "模型是否带音高指导": "Se o modelo tiver um guia de tons.",
  "要置入的模型信息": "Informações sobre o modelo a ser colocado.",
  "保存的模型名不带后缀": "Nome do modelo salvo sem extensão.",
  "模型版本型号": "Versão do modelo e modelo",
  "融合": "Fusão.",
  "修改模型信息(仅支持weights文件夹下提取的小模型文件)": "Modificar informações do modelo (suporta apenas pequenos arquivos de modelo extraídos para a pasta de weights).",
  "模型路径": "Caminho do modelo",
  "要改的模型信息": "Informações do modelo para modificar",
  "保存的文件名, 默认空为和源文件同名": "Nome do arquivo para salvar, o padrão é igual ao nome do arquivo de origem",
  "修改": "Modificar",
  "查看模型信息(仅支持weights文件夹下提取的小模型文件)": "Visualizar informações do modelo (aplicável apenas a pequenos arquivos de modelo extraídos da pasta 'weights')",
  "查看": "Ver",
  "模型提取(输入logs文件夹下大文件模型路径),适用于训一半不想训了模型没有自动提取保存小文件模型,或者想测试中间模型的情况": "Extração de modelo (insira o caminho de um arquivo de modelo grande na pasta 'logs'), aplicável quando você deseja extrair um arquivo de modelo pequeno após o treinamento na metade e ele não foi salvo automaticamente, ou quando você deseja testar um modelo intermediário",
  "保存名": "Salvar nome",
  "模型是否带音高指导,1是0否": "Se o modelo tiver guia de tons, 1 para sim, 0 para não",
  "提取": "extrator",
  "Onnx导出": "Exportar Onnx",
  "RVC模型路径": "Caminho do modelo RVC",
  "Onnx输出路径": "Rota de saída Onnx",
  "导出Onnx模型": "Exportar modelo Onnx",
  "常见问题解答": "Perguntas frequentes",
  "招募音高曲线前端编辑器": "Recrute editores front-end para curvas de tom",
  "加开发群联系我xxxxx": "Me ache discord Saiyd",
  "点击查看交流、问题反馈群号": "Haga clic para ver el número de grupo de comunicación y comentarios sobre problemas",
  "xxxxx": "xxxxx",
  "加载模型": "Carregar modelo",
  "Hubert模型": "Modelo de Hubert ",
  "选择.pth文件": "Selecione o arquivo .pth",
  "选择.index文件": "Selecione arquivo .index",
  "选择.npy文件": "selecione arquivo .npy",
  "输入设备": "Dispositivo de entrada",
  "输出设备": "Dispositivo de saida",
  "音频设备(请使用同种类驱动)": "Dispositivo de audio (use o mesmo tipo de driver)",
  "响应阈值": "Limite de resposta",
  "音调设置": "Ajuste de tom",
  "Index Rate": "Taxa de índice",
  "常规设置": "Configuração geral",
  "采样长度": "Comprimento de amostragem",
  "淡入淡出长度": "Duração do aparecimento/desaparecimento gradual",
  "额外推理时长": "Tiempo de inferencia adicional",
  "输入降噪": "Redução de ruído de entrada",
  "输出降噪": "Redução de ruído de saída",
  "性能设置": "Configurações de desempenho",
  "开始音频转换": "Iniciar conversão de áudio",
  "停止音频转换": "Pare a conversão de áudio",
  "推理时间(ms):": "Inferir tempo (ms):",
  "请选择pth文件": "请选择pth文件",
  "请选择index文件": "请选择index文件",
  "hubert模型路径不可包含中文": "hubert模型路径不可包含中文",
  "pth文件路径不可包含中文": "pth文件路径不可包含中文",
  "index文件路径不可包含中文": "index文件路径不可包含中文",
  "重载设备列表": "Recarregar lista de dispositivos",
  "音高算法": "音高算法",
  "harvest进程数": "harvest进程数",
  "选择音高提取算法,输入歌声可用pm提速,harvest低音好但巨慢无比,crepe效果好但吃GPU,rmvpe效果最好且微吃GPU": "Selecione o algoritmo de extração de pitch ('pm': extração mais rápida, mas com qualidade de fala ruim; 'harvest': graves melhores, mas muito lentos; 'crepe': melhor qualidade, mas mais intensivo em GPU), 'rmvpe': melhor qualidade e baixo Requisitos de GPU",
  "rmvpe卡号配置：以-分隔输入使用的不同进程卡号,例如0-0-1使用在卡0上跑2个进程并在卡1上跑1个进程": "Insira índice(s) de GPU separados por '-', por exemplo, 0-0-1 para usar 2 processos em GPU0 e 1 processo em GPU1"

}
